[
    {
        "date": "07/30/2024",
        "time": "12:56pm",
        "text": "Understanding negative Z-Index with CSS is such a game changer."
    },
    {
        "date": "07/23/2024",
        "time": "9:15pm",
        "text": "I think one of things taken for granted in the current times is the ubiquity of gloves."
    },
    {
        "date": "07/05/2024",
        "time": "9:54am",
        "text": "I swear most of the time im just trying to get my ducks in a row, but there are 8 ducks and two squirrels."
    },
    {
        "date": "06/28/2024",
        "time": "9:12am",
        "text": "I feel like ynab really did us dirty when they went web based and charged a subscription. I just booted up ynab4 and side loaded the classic app and im more than happy with it. "
    },
    {
        "date": "06/05/2024",
        "time": "1:00pm",
        "text": "I found the coolest little app that brings the nook life into my work. This music plus the hourly chimes is enchanting. https://nook.camp/"
    },
    {
        "date": "05/25/2024",
        "time": "1:05pm",
        "text": "After a bunch of headache I finally got Steam to run games off my secondary hard drive. The problem was with how it was mounted in `/etc/fstab` here is my line to mount the drive now. If anyone has a comment to improve it please let me know. `UUID=567EFBB57EFB8BCD /media/programs ntfs uid=1000,gid=1000,rw,user,nosuid,nodev,nofail,exec,umask=000,x-gvfs-show 0 0`.  \n I also installed steam via flatpak and needed to tell steam it could access the drives using flatseal"
    },
    {
        "date": "05/24/2024",
        "time": "1:05pm",
        "text": "Whenever I end up behind a motorcycle while driving I automatically designate myself as their rear guard."
    },
    {
        "date": "05/23/2024",
        "time": "3:39pm",
        "text": "It takes a lot for me to leave daddy Microsoft but having an AI that screen watches me is the I-beam that does it. Linux time."
    },
    {
        "date": "05/22/2024",
        "time": "2:24pm",
        "text": "One of my most favorite and also cringiest CSS tricks is stacking classes to override specificity:  \n`.foo.foo.foo {...}`"
    }
]