[
    {
        "date": "09/03/2024",
        "time": "4:41pm",
        "text": "Finally got a Windows10 VM running on my Linux partition the way I want it to. I may be able to primarily switch to Linux from here on out. The few windows exclusive apps I use on Windows are now at my disposal."
    },
    {
        "date": "08/31/2024",
        "time": "11:09pm",
        "text": "I wish Twitter didn't take such a downturn. I really want to share my cool [Codepen about how I used border images to create a torn paper look](https://codepen.io/brucebrotherton/pen/JjQaENz) for some content. But now, nobody will see it there.[![Screenshot of website with torn paper borders.](/images/torn-border.png)](https://codepen.io/brucebrotherton/pen/JjQaENz) \n\n If you want to read more, I wrote a whole [blog post about border images](/blog/border-image)."
    },
    {
        "date": "08/09/2024",
        "time": "3:00pm",
        "text": "Now that I've been working out for a bit. I've found it odd that, if I don't workout, I feel like I haven't earned the right to use my body."
    },
    {
        "date": "07/30/2024",
        "time": "3:09pm",
        "text": "In the Tau it is the space between things that has value. Its not the walls of the house that has value, its the things and people inside it. Its not the spokes of a wheel that creates its value, its the space between that makes it a circle.  \n\nLikewise with excerise and training, I'm building up these pillars so the spaces inbetween the workouts is where I will generate value.  \n\nThe days where I can spend the entire time chasing my daughter around the water park and still have energy afterward is what makes its great. "
    },
    {
        "date": "07/30/2024",
        "time": "12:56pm",
        "text": "Understanding negative Z-Index with CSS is such a game changer."
    },
    {
        "date": "07/23/2024",
        "time": "9:15pm",
        "text": "I think one of things taken for granted in the current times is the ubiquity of gloves."
    },
    {
        "date": "07/05/2024",
        "time": "9:54am",
        "text": "I swear most of the time im just trying to get my ducks in a row, but there are 8 ducks and two squirrels."
    },
    {
        "date": "06/28/2024",
        "time": "9:12am",
        "text": "I feel like ynab really did us dirty when they went web based and charged a subscription. I just booted up ynab4 and side loaded the classic app and im more than happy with it. "
    },
    {
        "date": "06/05/2024",
        "time": "1:00pm",
        "text": "I found the coolest little app that brings the nook life into my work. This music plus the hourly chimes is enchanting. https://nook.camp/"
    },
    {
        "date": "05/25/2024",
        "time": "1:05pm",
        "text": "After a bunch of headache I finally got Steam to run games off my secondary hard drive. The problem was with how it was mounted in `/etc/fstab` here is my line to mount the drive now. If anyone has a comment to improve it please let me know. `UUID=567EFBB57EFB8BCD /media/programs ntfs uid=1000,gid=1000,rw,user,nosuid,nodev,nofail,exec,umask=000,x-gvfs-show 0 0`.  \n\n I also installed steam via flatpak and needed to tell steam it could access the drives using flatseal"
    },
    {
        "date": "05/24/2024",
        "time": "1:05pm",
        "text": "Whenever I end up behind a motorcycle while driving I automatically designate myself as their rear guard."
    },
    {
        "date": "05/23/2024",
        "time": "3:39pm",
        "text": "It takes a lot for me to leave daddy Microsoft but having an AI that screen watches me is the I-beam that does it. Linux time."
    },
    {
        "date": "05/22/2024",
        "time": "2:24pm",
        "text": "One of my most favorite and also cringiest CSS tricks is stacking classes to override specificity:  \n`.foo.foo.foo {...}`"
    }
]